{
  "symptom_data": {
    "no_cooling": {
      "label": "No cold air",
      "tips": [
        "Make sure your thermostat is set to COOL and the temperature is below room temp.",
        "Check your air filter — a clogged filter can block airflow completely.",
        "Look at your circuit breaker panel for any tripped switches.",
        "Make sure nothing is blocking your outdoor unit (debris, leaves, snow)."
      ],
      "seasonal_winter": "If it's cold outside, your AC has a low-ambient lockout and won't run below a certain temperature — that's normal and protects the equipment.",
      "seasonal_summer": "During heat waves, most AC systems can only cool about 15-20°F below the outdoor temp. If it's 100°F out, 80°F inside may be all your system can manage."
    },
    "no_heat": {
      "label": "No heat",
      "tips": [
        "Check that your thermostat is set to HEAT and above room temperature.",
        "If you have a furnace, check whether the pilot light is on (older models).",
        "Make sure your air filter isn't clogged — this is one of the most common causes.",
        "Check your breaker panel for any tripped switches."
      ],
      "seasonal_winter": "In freezing weather, keep your home above 55°F even when you're away to prevent frozen pipes. Opening cabinet doors under sinks helps warm air circulate around pipes."
    },
    "strange_noise": {
      "label": "Strange noises",
      "tips": [
        "Banging or clanking — usually a loose or broken part inside the unit.",
        "Squealing or screeching — often a belt or motor bearing that needs attention.",
        "Buzzing — may be an electrical component or a failing contactor.",
        "Rattling — could be a loose panel, screw, or something in the ductwork."
      ]
    },
    "leaking": {
      "label": "Leaking or water",
      "tips": [
        "Clogged condensate drain line — this is the most common cause and usually a straightforward fix.",
        "Frozen evaporator coil — turn the system off and let it thaw, then check your filter.",
        "Cracked or rusted drain pan — especially common in units over 10 years old.",
        "If there's a lot of water, turn the system off to prevent further damage to your home."
      ]
    },
    "wont_start": {
      "label": "Won't turn on",
      "tips": [
        "Check your thermostat — make sure it's powered on and batteries aren't dead.",
        "Look at your circuit breaker panel for any tripped breakers.",
        "Check the furnace/AC power switch (usually looks like a light switch near the unit).",
        "If you have an outdoor unit, make sure nothing is blocking or covering it."
      ]
    },
    "short_cycling": {
      "label": "Turns on/off quickly",
      "tips": [
        "This is called 'short cycling' and it puts a lot of stress on the equipment.",
        "Check your air filter first — a clogged filter is the number one cause.",
        "Make sure your thermostat isn't near a heat source like a sunny window or vent.",
        "If the filter is clean, it could be a refrigerant or sizing issue that needs professional attention."
      ]
    },
    "weak_airflow": {
      "label": "Weak airflow",
      "tips": [
        "Check your air filter — this is the most common cause of reduced airflow.",
        "Make sure all vents and registers throughout your home are open and unblocked.",
        "Listen for the blower fan — if it's not running, the motor may need attention.",
        "Leaks or blockages in ductwork can also reduce flow and need professional inspection."
      ]
    },
    "bad_smell": {
      "label": "Strange smell",
      "tips": [
        "Musty or moldy smell — likely mold or mildew on the evaporator coil or in ductwork.",
        "Burning smell — turn the system off immediately and check near the unit for any burning odors.",
        "Rotten egg smell — this could indicate a gas leak. Leave the house immediately and call your gas company, then call us.",
        "Dusty smell when first turning on for the season — usually normal and should clear within an hour."
      ]
    }
  },

  "safety_tips": {
    "gas_smell": "Important: If you smell rotten eggs or gas, leave your home immediately. Don't flip any switches. Call 911 or your gas company from outside, then give us a call.",
    "no_heat_winter": "While you wait: use space heaters safely (keep them 3 feet from anything flammable), never use your oven or stove to heat your home, and keep interior doors open to help circulate whatever warmth is there.",
    "no_cooling_summer": "While you wait: close blinds and curtains on sun-facing windows, use fans to circulate air, stay hydrated, and try not to use your oven — it adds a lot of heat to your home.",
    "electrical": "If you see sparks, smell burning from the unit, or hear loud popping sounds, turn your system off at the breaker immediately. Don't try to restart it — let a technician take a look.",
    "water_damage": "If there's significant water, turn the system off and move any electronics or valuables away from the area. Towels and a bucket can help contain things until we get there.",
    "general": "While you're waiting for your technician: make sure the area around your indoor and outdoor units is clear and accessible. If you have pets, it helps to keep them in another room when the tech arrives."
  },

  "welcome": {
    "messages_variants": [
      ["Hi, thanks for reaching out to Metro Boston HVAC. How can we help you today?"],
      ["Hello! Welcome to Metro Boston HVAC. What can we help you with?"],
      ["Hi there — Metro Boston HVAC here. Let us know what's going on and we'll point you in the right direction."]
    ],
    "messages": [
      "Hi, thanks for reaching out to Metro Boston HVAC. How can we help you today?"
    ],
    "options": [
      { "label": "My system isn't working right", "next": "emergency", "icon": "alert" },
      { "label": "I need maintenance", "next": "maintenance", "icon": "tool" },
      { "label": "I'd like a quote", "next": "quote", "icon": "dollar" },
      { "label": "General question", "next": "general", "icon": "question" },
      { "label": "What happens during a service call?", "next": "what_to_expect", "icon": "info" }
    ]
  },

  "welcome_winter": {
    "messages_variants": [
      ["Hi — Metro Boston HVAC here. Whether your heat needs attention or you just want a checkup before the cold sets in, we can help. What's going on?"],
      ["Hello! Metro Boston HVAC. Heating issues don't wait for convenient timing — neither do we. How can we help?"]
    ]
  },

  "welcome_summer": {
    "messages_variants": [
      ["Hi — Metro Boston HVAC here. If your AC is giving you trouble or you're thinking about an upgrade, we can help. What do you need?"],
      ["Hello! Metro Boston HVAC. Keeping cool is the priority — let us know what's going on."]
    ]
  },

  "return_welcome_emergency": {
    "messages": [
      "Welcome back! Is everything running okay, or do you still need a hand?"
    ],
    "options": [
      { "label": "All good now", "next": "return_resolved" },
      { "label": "Still having issues", "next": "emergency" },
      { "label": "Something else", "next": "welcome" }
    ]
  },

  "return_resolved": {
    "messages": [
      "Good to hear. Is there anything else we can help with?"
    ],
    "options": [
      { "label": "I need maintenance", "next": "maintenance" },
      { "label": "I'd like a quote", "next": "quote" },
      { "label": "Nope, just checking in!", "next": "goodbye" }
    ]
  },

  "goodbye": {
    "messages": [
      "Sounds good. We're here 24/7 if anything comes up. Take care."
    ]
  },

  "emergency": {
    "messages": [
      "Okay — select everything that applies so we can help:"
    ],
    "type": "multi_select",
    "symptom_keys": ["no_cooling", "no_heat", "strange_noise", "leaking", "wont_start", "short_cycling", "weak_airflow", "bad_smell"]
  },

  "system_age": {
    "messages": [
      "One more thing that helps — roughly how old is your system?"
    ],
    "options": [
      { "label": "Less than 5 years", "next": "system_age_new" },
      { "label": "5-10 years", "next": "system_age_mid" },
      { "label": "10-15 years", "next": "system_age_older" },
      { "label": "Over 15 years", "next": "system_age_old" },
      { "label": "No idea", "next": "system_age_unknown" }
    ]
  },

  "system_age_new": {
    "messages": [
      "Good news — a system under 5 years old is likely still under manufacturer warranty. Make sure to have your warranty info handy when our tech arrives, as it could save you on parts costs.",
      "Let's get someone out to take a look."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Contact Us Online", "url": "contact.html" },
    "options": [
      { "label": "What should I expect during the visit?", "next": "what_to_expect" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "system_age_mid": {
    "messages": [
      "5-10 years is solid — your system should have plenty of life left. Most issues at this age are straightforward repairs.",
      "Let's get a technician out to diagnose it properly."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Contact Us Online", "url": "contact.html" },
    "options": [
      { "label": "What should I expect during the visit?", "next": "what_to_expect" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "system_age_older": {
    "messages": [
      "At 10-15 years, most systems are approaching the back half of their lifespan. Repairs are usually still worthwhile, but it's good to keep an eye on efficiency.",
      "We'll always give you an honest assessment — if a repair makes more sense than a replacement, that's what we'll recommend."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Contact Us Online", "url": "contact.html" },
    "options": [
      { "label": "What would a new system cost?", "next": "maintenance_new" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "system_age_old": {
    "messages": [
      "Over 15 years — your system has done well! At this age, it's worth being honest: sometimes the cost of a major repair isn't the best investment compared to upgrading.",
      "That said, we've seen plenty of older systems that just need a small fix. Our tech will give you a straightforward diagnosis and help you weigh your options — no pressure either way."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Explore New System Options", "url": "quote.html" },
    "options": [
      { "label": "Tell me about heat pumps", "next": "heat_pump_info" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "system_age_unknown": {
    "messages": [
      "No worries — our technician can tell you the age and condition when they come out. It's part of the diagnosis.",
      "Let's get someone scheduled."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Contact Us Online", "url": "contact.html" },
    "options": [
      { "label": "What should I expect during the visit?", "next": "what_to_expect" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "what_to_expect": {
    "messages": [
      "Great question — here's how a typical service call works with us:",
      "1. You call or contact us, and we ask a few questions about the issue.\n2. We dispatch a technician — usually within the hour for emergencies.\n3. The tech arrives, introduces themselves, and does a thorough diagnosis.\n4. You get upfront pricing explained clearly before any work begins — no surprises.\n5. If you approve, we do the repair right then and there in most cases.\n6. We clean up after ourselves and make sure everything's running properly before we leave.",
      "We've been doing this for 30+ years in the Stoughton area, so you're in experienced hands. Anything else you'd like to know?"
    ],
    "phone_cta": true,
    "options": [
      { "label": "What will it cost?", "next": "faq_emergency_pricing" },
      { "label": "What's your service area?", "next": "faq_service_area" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "while_you_wait": {
    "messages": [
      "Here are a few things you can do while waiting for the technician:"
    ]
  },

  "maintenance": {
    "messages": [
      "Smart move — regular maintenance is honestly the single best way to avoid surprise breakdowns and keep your energy bills in check.",
      "Are you looking to maintain an existing system, or thinking about a new installation?"
    ],
    "options": [
      { "label": "Maintain my current system", "next": "maintenance_existing" },
      { "label": "New installation", "next": "maintenance_new" }
    ]
  },

  "maintenance_existing": {
    "messages": [
      "Keeping your system maintained is the best thing you can do to extend its life and keep it efficient.",
      "When was the last time it had a professional tune-up?"
    ],
    "options": [
      { "label": "Over a year ago", "next": "maintenance_overdue" },
      { "label": "Never or not sure", "next": "maintenance_overdue" },
      { "label": "Within the last year", "next": "maintenance_recent" }
    ]
  },

  "maintenance_overdue": {
    "messages": [
      "It's probably a good time to schedule one. Dust buildup and normal wear can reduce efficiency by 5-10% each year — which adds up on your utility bills pretty quickly.",
      "Our seasonal tune-up includes a full inspection, cleaning, safety checks, and performance testing. It helps catch small things before they turn into expensive problems.",
      "Give us a call or reach out online — we'll find a time that works for your schedule."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Contact Us to Schedule", "url": "contact.html" },
    "options": [
      { "label": "What does a tune-up cost?", "next": "quote_maintenance" },
      { "label": "Do you have any specials?", "next": "offers_plug" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "maintenance_recent": {
    "messages": [
      "Good to hear you're staying on top of things! Is something specific going on, or are you just exploring your options?"
    ],
    "options": [
      { "label": "Something seems off with my system", "next": "emergency" },
      { "label": "Just exploring options", "next": "quote" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "maintenance_new": {
    "messages": [
      "If you're considering a new system, heat pumps are definitely worth looking into. They handle both heating and cooling in one unit and are incredibly energy efficient.",
      "Here's the big one: Massachusetts has some of the best incentives in the country through Mass Save. Many homeowners qualify for rebates of $1,250-$10,000+ depending on the system — which makes a huge difference on the upfront cost.",
      "We can walk you through all the options and help you figure out exactly what rebates apply to your situation."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Get an Instant Quote", "url": "quote.html" },
    "options": [
      { "label": "Tell me more about heat pumps", "next": "heat_pump_info" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "heat_pump_info": {
    "messages": [
      "Heat pumps are one of the smartest upgrades for a New England home. Here's why folks love them:",
      "• They heat AND cool — one system, year-round comfort\n• Up to 3x more energy efficient than traditional furnaces\n• Modern units work great even at -15°F (no more \"heat pumps don't work in cold weather\")\n• Mass Save rebates can significantly offset the installation cost\n• Lower carbon footprint and quieter operation",
      "We've installed hundreds across the Metro Boston area and can do a free assessment of your home to recommend the right setup. No obligation."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Get an Instant Quote", "url": "quote.html" },
    "options": [
      { "label": "What does installation cost?", "next": "quote_installation" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "quote": {
    "messages": [
      "Sure thing — what type of service are you looking for?"
    ],
    "options": [
      { "label": "Repair", "next": "quote_repair" },
      { "label": "New installation", "next": "quote_installation" },
      { "label": "Maintenance plan", "next": "quote_maintenance" }
    ]
  },

  "quote_repair": {
    "messages": [
      "For repairs, the cost depends on what's going on. Our diagnostic fee is $79, and if you go ahead with the repair, we waive it entirely — so you're only paying for the fix.",
      "What type of system do you have?"
    ],
    "options": [
      { "label": "Central AC", "next": "quote_system_selected" },
      { "label": "Furnace", "next": "quote_system_selected" },
      { "label": "Heat pump", "next": "quote_system_selected" },
      { "label": "Boiler", "next": "quote_system_selected" },
      { "label": "Not sure", "next": "quote_system_selected" }
    ]
  },

  "quote_installation": {
    "messages": [
      "New installations vary based on your home's size, existing setup, and the type of system. We always start with a free in-home assessment so we can give you an accurate quote with no surprises.",
      "What are you interested in?"
    ],
    "options": [
      { "label": "Central AC", "next": "quote_system_selected" },
      { "label": "Furnace", "next": "quote_system_selected" },
      { "label": "Heat pump", "next": "quote_system_selected" },
      { "label": "Boiler", "next": "quote_system_selected" },
      { "label": "Not sure yet", "next": "quote_system_selected" }
    ]
  },

  "quote_maintenance": {
    "messages": [
      "Our maintenance plans help keep your system running smoothly and catch problems early. Most of our customers find that regular tune-ups pay for themselves in lower energy bills and avoided repairs.",
      "For pricing based on your specific system, give us a call or try our instant quote tool."
    ],
    "phone_cta": true,
    "link_cta": { "label": "Try Our Instant Quote Tool", "url": "quote.html" },
    "options": [
      { "label": "Do you have any specials?", "next": "offers_plug" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "quote_system_selected": {
    "messages": [
      "Thanks for sharing that. For the most accurate pricing, our team can give you a detailed estimate over the phone or in person.",
      "We always provide upfront pricing — you'll know exactly what the job costs before any work begins. No hidden fees, ever.",
      "Would you like to give us a call, or would you prefer to use our online quote tool?"
    ],
    "phone_cta": true,
    "link_cta": { "label": "Get an Instant Quote", "url": "quote.html" },
    "options": [
      { "label": "Do you have any current offers?", "next": "offers_plug" },
      { "label": "What should I expect during a service call?", "next": "what_to_expect" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "offers_plug": {
    "messages": [
      "We do! Right now we have a $79 diagnostic fee (waived with repair), $25 off your first service, no after-hours fees for emergency calls, and 10% off for seniors and veterans. You can clip them right from the page."
    ],
    "link_cta": { "label": "View & Clip Current Offers", "url": "offers.html" },
    "options": [
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "general": {
    "messages": [
      "Sure — what would you like to know?"
    ],
    "options": [
      { "label": "Service area", "next": "faq_service_area" },
      { "label": "Hours of operation", "next": "faq_hours" },
      { "label": "Payment options", "next": "faq_payment" },
      { "label": "Emergency pricing", "next": "faq_emergency_pricing" },
      { "label": "What happens during a service call?", "next": "what_to_expect" }
    ]
  },

  "faq_service_area": {
    "messages": [
      "We're based in Stoughton, MA and cover the entire Metro Boston area — roughly a 30-mile radius. That includes Brockton, Quincy, Canton, Norwood, Randolph, Milton, Weymouth, Braintree, and many more.",
      "Not sure if you're in our range? Just give us a quick call and we'll let you know right away."
    ],
    "phone_cta": true,
    "options": [
      { "label": "Ask another question", "next": "general" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "faq_hours": {
    "messages": [
      "We're available 24 hours a day, 7 days a week for emergencies — nights, weekends, holidays, all of it.",
      "For non-emergency appointments, we typically schedule Monday through Saturday. But if you need us, we're here. That's a promise."
    ],
    "phone_cta": true,
    "options": [
      { "label": "Ask another question", "next": "general" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "faq_payment": {
    "messages": [
      "We try to make things easy. We accept all major credit cards, cash, and checks.",
      "For bigger jobs like installations, we offer financing options so cost doesn't have to stand between you and being comfortable in your home. Just ask about it when you call."
    ],
    "phone_cta": true,
    "options": [
      { "label": "Ask another question", "next": "general" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "faq_emergency_pricing": {
    "messages": [
      "We believe in straightforward, honest pricing. Our diagnostic fee is $79, and we waive it completely if you go ahead with the repair.",
      "One thing we're really proud of — we don't charge extra for after-hours, weekends, or holidays. The price is the price, no matter when you need us. That's not common in this industry, but we think it's the right way to do business."
    ],
    "phone_cta": true,
    "link_cta": { "label": "View Current Offers", "url": "offers.html" },
    "options": [
      { "label": "Ask another question", "next": "general" },
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  },

  "fallback": {
    "messages": [
      "Hmm, I'm not sure I can help with that one here. But our team absolutely can — give us a call at (781) 408-2506. We're available 24/7 and happy to help."
    ],
    "phone_cta": true,
    "options": [
      { "label": "Start over", "next": "welcome", "restart": true }
    ]
  }
}
